# GetVPClOvrdObjTxt

## Description
```pascal
FUNCTION GetVPClOvrdObjTxt(
				viewportHandle : HANDLE;
				className      : STRING) : INTEGER;
```

```python

def vs.GetVPClOvrdObjTxt(viewportHandle, className):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle|
|className|STRING|The name of the class override|

## Version
Availability: from Vectorworks 2018
## Category
* Viewports